eac-core/eac/eacWebServiceApp/src/test/resources/soap/v2/redeemActivationCodesRequest1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eac="http://eac.oup.com/2.0/eac-access-services"
xmlns:cmn="http://eac.oup.com/2.0/eac-common-types">
   <soapenv:Header/>
   <soapenv:Body>
      <eac:RedeemActivationCodeRequest >
      	 <cmn:wsUserId>
         	<cmn:sessionToken>123456</cmn:sessionToken>
         </cmn:wsUserId>
         <eac:activationCode>AC1</eac:activationCode>
         <eac:locale language="en" country="GB" />
      </eac:RedeemActivationCodeRequest>
   </soapenv:Body>
</soapenv:Envelope>
